[
  {
    "id": "the-bone-temple",
    "title": "28 Years Later: The Bone Temple",
    "director": "Michael Mann",
    "image": "images/subpages/reviews/the-bone-temple.jpg",
    "rating": 4,
    "duration": "109 mins",
    "year": "2026",
    "watchDate": "Watched 20 Jan 2026",
    "content": [
      "It paints the post-Brexit anxieties of the British psyche as they come to terms with their increasing isolation and abandonment. The zombies here are more of a backdrop than in any of the other films: instead, we see an exploration of belief in a world where all gods have been wiped out by the apocalypse. One path to it may mean allegiance to a Satanist warlord, where the odds seem better than going at it alone. However, Dr. Kelson (played by Ralph Fiennes) offers another way of radically believing in humanity. It is a belief that keeps intact not only its history, from each individually cleaned skull in the ossuary down to the grooves of a vinyl, but also its universal impulse toward accepting every person, where zombies stop being caricature stand-ins for the Other (immigrant, non-white, different) and humanity alters itself in the process—through and after the Rage virus."
    ]
  },
  {
    "id": "thief",
    "title": "Thief",
    "director": "Michael Mann",
    "image": "images/subpages/reviews/thief.jpg",
    "rating": 4,
    "duration": "123 mins",
    "year": "1981",
    "watchDate": "Watched 13 Jan 2026",
    "content": [
      "In the haunting coldness of the Great Lakes on the eve of neoliberalism, Frank, an ex-con and thief, moves from nothing to having everything and back to nothing again. Since the banks and companies already made their wealth through theft, stealing from them can only be honest work, at least until a new boss inserts himself to siphon it off, triggering another cycle of violence and retribution. When Frank reaches the top—having a wife, a child, a house, a car, designer clothes—all the signifiers of individual accomplishment become liabilities that reduce him to being just another worker, no labor union."
    ]
  },
  {
    "id": "history-lessons",
    "title": "History Lessons",
    "director": "Straub-Huillet",
    "image": "images/subpages/reviews/history-lessons.jpg",
    "rating": 5,
    "duration": "88 mins",
    "year": "1972",
    "watchDate": "Watched 15 Jan 2026",
    "content": [
      "<q>Look at his Senate: a market hall.</q>",
      "<q>Is trading not a war?</q>",
      "Not long after the riots of ’68, a young person interviews historical figures of ancient Rome to learn that Caesar’s political moves did not originate in his personality and cunning but were instead the result of a crude fiscal optimization of the companies that operated in the Mediterranean world market: a class society that in its basic parameters hasn’t changed much, whether you found yourself in the 1st, 7th, or 20th centuries.",
      "Straub-Huillet’s method of disconnect reflects their dialectical spirit, refusing to become purely descriptive aestheticians as much as avoiding a condescending didacticism. There is the disconnect of the direct sound and long take against the abrupt cut at the right moment, forcing the viewer to engage critically. There is the disconnect between Brecht’s literary material and its visual representation. The steel car forces its way against the aging streets of Rome and their bustling masses. The youthful interviewer in a striped suit listens to old Roman characters.",
      "Four people are interviewed: a banker, a peasant-soldier, a lawyer, and a poet. The banker is given almost half the time, in two different sequences, and much like the Financial Times, he gives a cold and objective perspective from the point of view of the business affairs. In his last scene we find out how his bank is doing well under C. Looking at the peasant, we can sense their vicious circle: superfluous rural workers are conscripted to fight for local leaders, only to return back to their plot of land and find their product cheapened on the market as they are outcompeted by the large latifundia that employed the slaves brought back from the conquests. The lawyer scolds the youth by extolling the virtues of private property. The poet offers a laid-back critique from his lounge chair.",
      "Between hearing them talk, there are three uninterrupted driving sequences with the camera fixed in the back seat and a few shorter scenes of water streams. One thinks of the trade routes and the aqueducts.",
      "But where are the slaves? It seemed that they were intentionally omitted from the interviews, but Straub-Huillet inserted their voice more subtly in the driving scenes, which go through the ancient slave quarters of Rome. There are PCI posters plastered on the buildings, doubling the directors’ political allegiance as Marxists. The masses get the same screen time, but what they would say can only be inferred through their movement in the streets and through the markets they have been forced into, in the infinite cycle of buying and selling.",
      "In the end, <i>History Lessons</i> can only insist on making evident the eternal class struggle underneath the “objective” commercial relations."
    ]
  },
  {
    "id": "h2o",
    "title": "H2O",
    "director": "Ralph Steiner",
    "image": "images/subpages/reviews/h2o.jpg",
    "rating": 4,
    "duration": "12 mins",
    "year": "1929",
    "watchDate": "Watched 12 Jan 2026",
    "content": [
      "The movement of water couldn’t be visually captured in painting or photography. To reflect upon a moving image of water, one had to wait until the 20th century. We could properly enframe its infinite movement only through film, which makes Ralph Steiner similar to hydroelectric engineers in their modernist impulse of taming the forces of nature.",
      "Structurally, the film starts as a neutral observation of a river flowing, which gradually evolves into a more and more abstract play of light, lines, shapes, and shadows.",
      "A particular stream is reduced to the essence of all water, as a Heraclitean agent of change, as anti-deterministic, as a distorted mirror of reality. With no more legibility as liquid, the unity of opposites is all that remains: a tension of the forceful erosion and destruction against the soft adaptability and development."
    ]
  },
  {
    "id": "eddington",
    "title": "Eddington",
    "director": "Ari Aster",
    "image": "images/subpages/reviews/eddington.jpg",
    "rating": 4,
    "duration": "149 mins",
    "year": "2025",
    "watchDate": "Watched 27 Aug 2025",
    "content": [
      "Prophetic.",
      "There is something demonic about the construction of a datacenter serving as backdrop to a small town’s descent into empty violence in the wake of BLM protests and COVID restrictions.",
      "For one, capital can only be allocated into more and more speculative outlets, crowding out any other potential investments that could benefit the people at large. Economically starved hinterland territories like Eddington hope to access some tax revenue from leasing their lots. Moreover, the data center surveills and haunts. The cloud is materialized. It’s a keen representation of both the externalization and embedding of our social sphere into the platform’s walled gardens. Toward the end of the film, Aster’s camera follows a POV of a TikTok streamed execution. What’s really being built here is infrastructure for digital psychosis growing out of anger-optimized engagement. Big tech is the only winner.",
      "False flags are a daily reality. We are shown a private jet with white provocateurs in BLM-marked clothes before they are deployed into protest zones, presumably to justify state crackdowns. Yet even demonstrating this falls under suspicion when anything and nothing can be true. Recent online discourse, illiteracy, short-form media consumption, attention reduction, they all contribute to our regression toward <i>mimesis</i>. BLM gestures get adopted without theoretical depth by white youth for superficial reasons, just as easily as they are dismissed as a naive phase next year.",
      "Each faction gets their own inconsistent truth, which is amplified through its repetition. There is no desire to shoulder the difficult work of constructing a Truth through the opening offered by BLM as Event. Instead, it gets betrayed either through refusal (like the conservative shopkeepers) or through shallow co-optation (liberal performativity). Maintaining fidelity to the event requires a deep commitment to its universalizing potential. An isolated police murder follows up into opposing <i>all</i> forces of Order and their web of surveillance technologies. Otherwise, there’s just stochastic violence and revenge fantasies.",
      "Not even a few months after <i>Eddington</i> premiered, Charlie Kirk’s assassination confirms the film’s outlook. Mimesis has won. The shooter’s meme-inscribed bullets literalize Ari Aster’s diagnosis: political action reduced to viral signifiers."
    ]
  },
  {
    "id": "baby-invasion",
    "title": "Baby Invasion",
    "director": "Harmony Korine",
    "image": "images/subpages/reviews/baby-invasion.jpg",
    "rating": 4,
    "duration": "79 mins",
    "year": "2024",
    "watchDate": "Watched 27 Mar 2025",
    "content": [
      "It’s quite unclear who is getting invaded.",
      "Plot: twitch stream of someone playing Funny Games the videogame, filmed with a body cam. Accutely aware of being dumb.",
      "Music: 80 minutes of rave from Burial.",
      "Korine insists on the degrees of separation now found in consuming video content. Take a common scene: a 3D-rendered character watches surveillance footage of a “real” live feed of a group invading McMansions, the latter being a blurred conception between real life and video games. A cacophony of interfaces, text, different forms of media and pounding music.",
      "The visuals fully reflect the narrative disjoint: a lot of renders, infrared footage, abrupt cuts, video game UI elements, and a variety of digital garnishes inspired by TikTok live filters. While this manner of presenting the film (if we can even call it that anymore) may be alienating enough, its real power comes from how close it actually represents reality. With each layer of abstraction added, the portrayed violence felt even closer. The form held me hostage as an active participant. There’s a simmering terror throughout all this, coupled with some dismissive laughs. It’s not really real, but why does it feel so? It touches on a dimension of film that was left untapped until short-form media and video games revolutionised our consumption patterns.",
      "Even when the image looks horrible, one could forgive it as intended, like its usage of genAI (the invaders blur their faces into babies in the “game”). A valid case that won’t contribute to the dissolution of proper art through replacing it with the average of its predecessors. We rather see our world portrayed as one already finds it, stupid slop included.",
      "It’s a hard watch. But in its ugliness I can’t help but find it interesting."
    ]
  },
  {
    "id": "shift",
    "title": "Shift",
    "director": "Toshio Matsumoto",
    "image": "images/subpages/reviews/shift.jpg",
    "rating": 5,
    "duration": "8 mins",
    "year": "1982",
    "watchDate": "Watched 14 Mar 2025",
    "content": [
      "Behind any static appearence there is a disorienting wealth of movement and change.",
      "The short is an early digital and high modernist distortion of a Japanese school building. Once the image gets moving via delayed digital pans & zooms, the whole 8 minutes could be described as a dread of never catching up. Droning music only seems to get louder and higher in pitch, while strategic pauses serve to insert more confusion.",
      "But in all this perplexity, something new emerges. A glimpse resembles the architecture of Habitat 67. A round window rhymes with a later digital cut-out. The materiality of the concrete walls begins to stand out. I can think of Japanese post-war reconstruction, its accelerated economic convergence with the US, as well as its early embrace of digital technologies. Retroactively, one can only see stagnation for 30 years. It’s an interesting coincidence that the crisis culminated in a real estate bubble: the building hints as much. A static photo hides its contradictory forces.",
      "The structure pulsates with a virtual potentiality that never materialized."
    ]
  },
  {
    "id": "meshes-of-the-afternoon",
    "title": "Meshes of the Afternoon",
    "director": "Maya Deren, Alexandr Hackenschmied",
    "image": "images/subpages/reviews/meshes-of-the-afternoon.jpg",
    "rating": 5,
    "duration": "14 mins",
    "year": "1943",
    "watchDate": "Watched 15 Mar 2025",
    "content": [
      "Coming back to the same only to find it different every time.",
      "To grasp the content at hand you have to parse shadows, recurring memories, or an interrupted phone connection. Meaning always appears as if by chance, like a dropped flower on the ground.",
      "Death is aptly portrayed as a reflection of the repetitiveness of life. To break free is to shatter this false mirror."
    ]
  },
  {
    "id": "bram-stokers-dracula",
    "title": "Bram Stoker’s Dracula",
    "director": "Francis Ford Coppola",
    "image": "images/subpages/reviews/bram-stokers-dracula.jpg",
    "rating": 4,
    "duration": "127 mins",
    "year": "1992",
    "watchDate": "Watched 02 Oct 2024",
    "content": [
      "Campy. Exciting. Neo-expressionism at its peak.",
      "These deep ridges on the red armor of Vlad Țepes are enough to feel the passion exuded by this film. Eiko Ishioka encased him in solid, eternal flesh. Beautiful rendition.",
      "Stunning shots all the way through. Winona’s character’s love struggles unfold against the foggy courtyards and opulent interiors.",
      "Their Romanian pronunciation was too on the nose to take seriously, but they name-dropped my hometown Bistrița, so I let it slip.",
      "It’s a fever dream world with echoes of Murnau. A cauldron of blood, passion and lust."
    ]
  },
  {
    "id": "film-socialisme",
    "title": "Film Socialisme",
    "director": "Jean-Luc Godard",
    "image": "images/subpages/reviews/film-socialisme.jpg",
    "rating": 5,
    "duration": "102 mins",
    "year": "2010",
    "watchDate": "Watched 11 Jul 2024",
    "content": [
      "Modernity’s flow being punctured by its concrete expressions. Godard even prefigured it with Costa Concordia’s sinking.",
      "Communism lives on through the youth. Odessa. Gaza.",
      "“<i>Immagina un deserto.</i>”"
    ]
  },
  {
    "id": "zone-of-interest",
    "title": "The Zone of Interest",
    "director": "Johnathan Glazer",
    "image": "images/subpages/reviews/zone-of-interest.jpg",
    "rating": 5,
    "duration": "105 mins",
    "year": "2023",
    "watchDate": "Watched 07 Feb 2024",
    "content": [
      "There’s a Native American tent that appears for about 5 seconds in one of the picnic scenes and that told me everything I needed to know about this film’s scope and portrayal of genocide and settler expansion. It’s up there with Night and Fog & Come and See.",
      "There is nothing distant or banal about it.",
      "Mica Levi’s music is beautifully haunting. Watching the film outside of a cinema doesn’t do it justice."
    ]
  },
  {
    "id": "sinofuturism",
    "title": "Sinofuturism (1839–2046 AD)",
    "director": "Lawrence Lek",
    "image": "images/subpages/reviews/sinofuturism.jpg",
    "rating": 4,
    "duration": "60 mins",
    "year": "2016",
    "watchDate": "Watched 29 Sep 2023",
    "content": [
      "“Where Sinofuturism intersects with gambling is in an intense belief in the future.”"
    ]
  },
  {
    "id": "red-desert",
    "title": "Red Desert",
    "director": "Michelangelo Antonioni",
    "image": "images/subpages/reviews/red-desert.jpg",
    "rating": 5,
    "duration": "117 mins",
    "year": "1964",
    "watchDate": "Watched 10 Aug 2023",
    "content": [
      "The industrial landscapes transcend mere decor and mechanical backdrops; they evolve into fully developed characters. Where else are oil puddles and sludge lakes so keen on inducing madness to someone? It reminded me of the planet in Solaris, bent on psychologically destroying whatever comes before it. It’s what makes it the most interesting part of the cast.",
      "For all its pretenses of scientific knowledge while destroying any fetters to its expansion, industrial modernity remains actively <i>opaque</i>. When Giuliana asks “How can you predict what you need?”, there is no answer back from the machines. Their functioning is simple-minded, short-sighted, unplanned. A polluting factory can go on profitably much like a madman can still “function”.",
      "<i>Red Desert</i> is not presenting us with a simple ecological indictement, it rather speaks about the inherent instability at the heart of modernity, which was supposed to be the culmination of perfect rationality and science.",
      "Giuliana embodies this excess outside the parameters of reference. Like exhaust, fumes, rusty red metal or other abstract forms of decay: “There’s something terrible about reality and I don’t know what it is.”"
    ]
  },
  {
    "id": "network",
    "title": "Network",
    "director": "Sydney Lumet",
    "image": "images/subpages/reviews/network.jpg",
    "rating": 5,
    "duration": "122 mins",
    "year": "1976",
    "watchDate": "Watched 10 Jun 2023",
    "content": [
      "All opposition is coopted.",
      "All the popular misgrievings are domesticated, diverted into endless and loud venting, just enough to keep the people away from enacting any change. “I’m very mad!”-like commentary is now engagement bait on Twitter’s For You.",
      "Californian counterculture is shedding its weak critique of the state to instead lead the way as its most enlightened ideologist.",
      "The USA is correctly described as a cybernetically planned economy just like the USSR, with capital having already established an interconnected world that destroyed all semblance of nationhood, under the reign of IBM, ITT etc. The bourgeois socialism of Jensen, in which “all men will hold a share of stock” predicted the pipe dreams of Silicon Valley ideologues aka the latest iteration of Network managers.",
      "Lumet hits the mark perfectly."
    ]
  }
]
